Repository: FeofanGreek/flows_editor
Catalog: lib/l10n/app_*.arb
Languages: ru

source: Back
ru: Назад

source: Select action type
ru: Выберите тип действия

source: Phrase, wich bot say first
ru: Фраза, которую бот скажет перед выполнением узла

# nameFunctionAndPythonCode
source: The name of the function and its Python code that the bot will execute
ru: Имя функции и ее код Python, который будет выполнять бот.

# nameOfFunction
source: Name of the function
ru: Название функции

source: Schema description for LLM
ru: Описание схемы для LLM

# schemaPropities
source: Schema properties
ru: Параметры для схемы

# addProperty
source: Add propierty
ru: Добавить параметр

source: Text value
ru: Текстовый параметр

source: Integer value
ru: Числовой параметр

source: List value
ru: Параметр список

source: Not selected
ru: Не выбрано

source: Remove property
ru: Удалить значение

source: Open saved project
ru: Открыть сохраненый проект

source: Start new project
ru: Начать новый проект

source: Information about app
ru: Информация о приложении

source: Node name
ru: Название узла

# runWithoutWaitingUserAction
source: Run node without waiting user action
ru: Запускать узел не дожидаясь фразы пользователя

source: Context processing strategy
ru: Стратегия накопления контекста

source: Accumulate context
ru: Копить весь контекст

source: Reset context
ru: Очистить контекст

# useSomeHistory
source: Use some of previos context history
ru: Использовать несколько предыдущих фраз

# actionRuningBeforeRuningNode
source: Action runing before run node
ru: Действие запускаемое перед стартом узла

source: Add pre action
ru: Добавить ПРЕ действие

source: System instruction for LLM
ru: Системная инструкция для LLM

# instructionForYourLLM
source: Instruction for your LLM, where you set scenario of this node
ru: Инструкция для вашей LLM, где вы описываете сценарий выполнения данного узла

source: Add system instruction
ru: Добавить системную инструкцию

source: Remove system instruction
ru: Удалить системную инструкцию

source: Instruction text
ru: Текст системной иснтрукции

# targetOnThisStage
source: Target for LLM on this stage
ru: Описание цели для LLM которая выполнит эту стадию

source: Target description
ru: Описание цели

# routingSchemeForSwitching
source: Routing scheme for switching to another nodes
ru: Схема переключения на следующий узел разговора

# descriptTaskForCompliting
source: Descript task for LLM for compliting this node
ru: Описание задачи для LLM, выполнение которой является условием перехода далее

source: Add flow
ru: Добавить схему

# actionsBeforeSwitching
source: Actions before switch to another node
ru: Дейтвие, выполняемое когда цель достигнута и нужно идти далее

source: Add post action
ru: Добавить ПОСТ действие

source: Save project
ru: Сохранить проект

source: Export to Python
ru: Экспорт в Python

source: Import from Python
ru: Импорт из Python

source: Short project name
ru: Короткое наименование проекта

source: Project description
ru: Описание проекта

source: Speech stages
ru: Стадии разговора

source: Add stage
ru: Добавить стадию

source: Project settings
ru: Настройки проекта

source: User guide
ru: Описание работы с приложением

source: Select value
ru: Выберите значение

source: Property description for LLM
ru: Описание параметра для LLM

# possibleValuesForLLMChoose
source: Possible values from which LLM will choose (field may be empty)
ru: Возможные значения из которых LLM сделает выбор (поле может быть пустым)

# listValues
source: List of values
ru: Список значений

# defaultValueIfLLMCannotMakeChoice
source: Default value if LLM cannot make a choice
ru: Значение по умолчанию, если LLM не сможет сделать выбор

# minimumAndMaximumNumberElementsInArray
source: The minimum and maximum number of elements in the array. (This field may be empty.)
ru: Минимальное и максимальное количество элементов в масиве (сколько LLM может выбрать). (Это поле можно оставить пустым)

source: Min integer value
ru: Минимальнео значение

source: Max integer value
ru: Максимальное значение

# stringLengthLimiter
source: String length limiter (fields may be empty)
ru: Ограничитель длины строки (поле можно оставить пустым)

# regexPattern
source: Regex pattern (field may be empty)
ru: Regex маска (поле можно оставить пустым)

source: Pattern
ru: Маска

# formattingReceivedResponse
source: Formatting the received response (the field may be empty, but the formatting may be useful for subsequent processing)
ru: Форматирование полученного от пользователея значения (поле можно оставить пустым, но форматирование может быть полезно вам для дальнейшей обработки)

source: Formatter
ru: Шаблон

# minimumAndMaximumAllowedValues
source: Minimum and maximum allowed values (inclusive). (This field may be empty.)
ru: Минимальное и максимальное допустимое значение (включительно). (Поле можно оставить пустым)

# valueMustStrictlyGreaterLessSpecifiedValue
source: The value must be strictly greater than or less than the specified value. (The field may be empty.)
ru: Значение должно быть строго меньше или больше чем указанное (Поле можно оставить пустым)

# valueMustMultipleSpecifiedNumber
source: The value must be a multiple of the specified number (e.g. `0.5`) (the field may be empty)
ru: Значение должно быть кратно указанному числу (e.g. `0.5`) (Поле можно оставить пустым)

source: Node description
ru: Описание узла

source: Extended settings
ru: Расширенные настройки

# parameterName
source: Parmeter name
ru: Имя параметра

source: Fill parameter name
ru: Заполните имя параметра

source: Cancel
ru: Отмена

source: Accept
ru: Применить

source: Remove node
ru: Удалить узел

# editNode
source: Change node
ru: Редактировать узел

# isRequired
source: Required
ru: Обязательный
